DENTAL_CORRECTIONS = {
    "λενογόνος": "βλεννογόνος",
    "λενογόνως": "βλεννογόνος",
    "ηγμόριο": "ιγμόρειο",
    "παριακών": "παρειακών",
    "γωνφίου": "γομφίου",
    "λεπνση": "λέπτυνση",
    "πιθμένα": "πυθμένα",
    "κόλμπου": "κόλπου",
    "ταριδονισμένου": "τερηδονισμένου",
    "ακολοφή": "ακρολοφή",
    "προχομφίου": "προγομφίου",
    "υποελληματικές": "υπολειμματικές",
    "ναθαίο": "γναθιαίου",
    "ναθαίου": "γναθιαίου",
    "προχομφίου": "προγομφίου",
    "προγωνφίου": "προγομφίου",
    "υποελληματικές": "υπολειμματικές",
    "ακολοφίας": "ακρολοφίας",
    "ακολοφή": "ακρολοφή",
    "άκρορριζική": "ακρορριζική",
    "ακροριζική": "ακρορριζική",
    "ρύζες": "ρίζες",
    "άποθέση": "άπω θέση",
}

def correct_dental_word(
        word: str,
        previous_words: list[str],
        next_words: list[str]
    ) -> str:
        
    clean_word = word.strip(" ,.!;:").lower()

    correction = DENTAL_CORRECTIONS.get(clean_word.lower())

    if correction:
        return correction

    return word